app/controllers/assignment_activations_controller.rb

  def load_lesson_module
      @lesson_module = LessonModule.find(params[:lesson_module_id])
---
SELECT * FROM "lesson_modules" WHERE ("lesson_modules"."id" = 1)