app/controllers/assignments_controller.rb

SELECT * FROM "assignments" WHERE (((developement = 'f') AND ("assignments".lesson_module_id = 2)) AND ("assignments".lesson_module_id = 2)) ORDER BY position ASC
---
  def index
    if user_signed_in?
      @assignments = @lesson_module.assignments.in_order.all

INSERT INTO "assignments" ("name", "position", "created_at", "css", "updated_at", "template", "lesson_module_id", "description", "js", "developement") VALUES('Zadanie 1', 1, '2010-07-15 10:03:34', NULL, '2010-07-15 10:03:34', NULL, 1, '', NULL, 't')
---
  def create
    @assignment = @lesson_module.assignments.new(params[:assignment])
    if @assignment.save

UPDATE "assignments" SET "updated_at" = '2010-07-15 14:06:27', "css" = '', "js" = '', "template" = '<a href=''javascript:finish_assignment()''>Zakończ zadanie</a>
---
  def update
    @assignment.update_attributes(params[:assignment])

DELETE FROM "assignments" WHERE "id" = 1
---
  def destroy
    @assignment.destroy

SELECT * FROM "assignments" WHERE ("assignments"."id" = 2)
UPDATE "assignments" SET position = (position + 1) WHERE (lesson_module_id = 1 AND position >= 1)
---
  def update_order
    if(params[:order])
      order = params[:order]

      begin
        order.each_with_index do |value, index|
          item = Assignment.find(value)
          item.insert_at(index+1)
          item.save!

INSERT INTO "assignments" ("name", "position", "created_at", "css", "updated_at", "template", "lesson_module_id", "description", "js", "developement") VALUES('First assignment(copy)', 2, '2010-08-12 10:41:00', '', '2010-08-12 10:41:00', '', 4, '', '', 't')
---
  def copy
    copy = Assignment.new(@assignment.attributes)
    copy.name += "(copy)"
    copy.insert_at(@assignment.position + 1)

SELECT * FROM "lesson_modules" WHERE ("lesson_modules"."id" = 4)
---
  def load_lesson_module
    @lesson_module = LessonModule.find(params[:lesson_module_id])

SELECT * FROM "assignments" WHERE ((lesson_module_id = 2) AND (position >= 2) AND (developement = 0)) LIMIT 1
---
  def load_assignment
    @assignment = @lesson_module.assignments.find(params[:id])