app/controllers/lesson_modules_controller.rb

SELECT * FROM "lesson_modules" WHERE (developement = 'f') ORDER BY position ASC
---
  def index
    if user_signed_in?
      @modules = LessonModule.in_order.all

INSERT INTO "lesson_modules" ("name", "position", "created_at", "updated_at", "template", "global_js", "description", "global_css", "developement") VALUES('Moduł pierwszy', 1, '2010-07-15 07:22:44', '2010-07-15 07:22:44', '<div id=''module_1''>{content}</div>', NULL, 'Opis modułu pierwszego', NULL, NULL)
---
  def create
    @module = LessonModule.new(params[:lesson_module])
    if @module.save

SELECT * FROM "lesson_modules" WHERE ("lesson_modules"."id" = 2)
---
  def edit
    @module = LessonModule.find(params[:id])

SELECT * FROM "lesson_modules" WHERE ("lesson_modules"."id" = 2)
UPDATE "lesson_modules" SET "updated_at" = '2010-07-15 08:49:00', "description" = 'Opis modułu drugiego2' WHERE "id" = 2
---
  def update
    @module = LessonModule.find(params[:id])
    @module.update_attributes(params[:lesson_module])

SELECT * FROM "lesson_modules" WHERE ("lesson_modules"."id" = 1)
UPDATE "lesson_modules" SET "updated_at" = '2010-07-15 08:08:11', "position" = NULL WHERE "id" = 1
---
  def update_order
    if(params[:order])
      order = params[:order]

      begin
        order.each_with_index do |value, index|
          item = LessonModule.find(value)
          item.insert_at(index+1)
          item.save!

SELECT * FROM "lesson_modules" WHERE ("lesson_modules"."id" = 3)
DELETE FROM "lesson_modules" WHERE "id" = 3
---
  def destroy
    @module = LessonModule.find(params[:id])
    @module.destroy